from dataclasses import dataclass


@dataclass
class BotMessages:
    messages = {
        "cond_terms_text": """Для того чтобы использовать бота, необходимо принять пользовательское соглашение:

✌️Добро пожаловать! Этот бот предоставляет различные услуги в автоматизированном режиме. Прежде чем использовать данный бот, пожалуйста, ознакомьтесь с нашим пользовательским соглашением. Оно необходимо для законного функционирования нашего сервиса.

👌Пользователь бота несет ответственность за загрузку и распространение авторской музыки. Бот не несет ответственности за любые нарушения авторских прав, связанные с загрузкой и распространением музыки. Пользователь обязан использовать бота только в соответствии с действующим законодательством и нормами морали и этики.

❤️ Бот не гарантирует непрерывность и безошибочность своей работы. Мы будем стараться предоставлять нашим пользователям лучший сервис, однако не гарантируем, что бот будет работать без перебоев и ошибок.

⏸️ Бот может временно приостановить свою работу или изменить услуги, предоставляемые пользователям, без предварительного уведомления.

📝 Бот оставляет за собой право изменять пользовательское соглашение в любое время без предварительного уведомления пользователей. Пользователи обязуются периодически проверять это соглашение на наличие изменений. Пользовательское соглашение всегда будет доступно в закрепе официального канала проекта @jammy_music

Используя этот бот, пользователь соглашается со всеми условиями этого пользовательского соглашения.

❤️ Спасибо за использование нашего бота!"""
    }
